Updated architecture Flows
